Repository: jerryshen1020-maker/SkillDock
Catalog: SkillDock/Localizable.xcstrings
Source language: en
Languages: zh_hans

# common.add
source: Add
zh_hans: 添加

# common.cancel
source: Cancel
zh_hans: 取消

# common.error.unknown
source: Unknown error
zh_hans: 未知错误

# git.batch.none
source: No Git sources available to update
zh_hans: 暂无 Git 来源可更新

# git.clone.inProgress
source: Cloning...
zh_hans: 克隆中...

# git.repo.empty
source: Repository URL cannot be empty
zh_hans: 仓库地址不能为空

# git.repo.missing
source: Missing repository URL
zh_hans: 缺少仓库地址

# git.source.exists
source: Git source already exists
zh_hans: Git 来源已存在

# settings.action.rescanSources
source: Rescan Sources
zh_hans: 重新扫描来源

# settings.action.revealInFinder
source: Reveal in Finder
zh_hans: 在 Finder 中显示目录

# settings.currentApp
source: Current App
zh_hans: 当前应用

# settings.language.subtitle
source: Takes effect immediately and is persisted locally.
zh_hans: 选择后立即生效，并自动保存到本地配置。

# settings.language.title
source: Language
zh_hans: 界面语言

# settings.subtitle
source: Manage app directory, switch language, and run basic maintenance here.
zh_hans: 在这里查看当前应用目录、切换语言并执行基础维护操作。

# settings.sync.title
source: Sync & Directory
zh_hans: 同步与目录

# settings.targetDirectory
source: Target Directory
zh_hans: 目标目录

# settings.title
source: Settings
zh_hans: 设置

# sidebar.apps
source: Apps
zh_hans: 应用

# sidebar.settings
source: Settings
zh_hans: 设置

# sidebar.sources
source: Sources
zh_hans: 来源管理

# skills.action.details
source: Details →
zh_hans: 详情 →

# skills.action.install
source: Install
zh_hans: 安装

# skills.action.remove
source: Remove
zh_hans: 移除

# skills.action.syncing
source: Syncing...
zh_hans: 同步中...

# skills.action.syncNow
source: Sync Now
zh_hans: 一键同步

# skills.conflict.keepAllExisting
source: Keep All Existing
zh_hans: 全部保留旧的

# skills.conflict.keepExisting
source: Keep Existing
zh_hans: 保留旧的

# skills.conflict.useAllIncoming
source: Use All Incoming
zh_hans: 全部用新的

# skills.conflict.useIncoming
source: Use Incoming
zh_hans: 替换为新的

# skills.diagnostics.copy
source: Copy Details
zh_hans: 复制详情

# skills.diagnostics.export
source: Export Log
zh_hans: 导出日志

# skills.diagnostics.gotIt
source: Got it
zh_hans: 知道了

# skills.diagnostics.retry
source: Retry Sync
zh_hans: 重新同步

# skills.diagnostics.title
source: Sync finished with warnings
zh_hans: 同步完成，但有异常项

# skills.empty.installed
source: No installed skills yet
zh_hans: 暂无已安装的 Skill

# skills.empty.noMatch
source: No matching skills found
zh_hans: 未找到匹配的 Skill

# skills.empty.repository
source: No repository skills found
zh_hans: 本地仓库暂无 Skill

# skills.error.loadInstalledFailed
source: Oops, failed to load installed skills
zh_hans: 哎呀，读取已安装 Skill 失败

# skills.error.notFound
source: This skill no longer exists
zh_hans: 该 Skill 已不存在

# skills.mode.installed
source: Installed
zh_hans: 已安装

# skills.mode.repository
source: Repository
zh_hans: 本地仓库

# source.action.addDirectory
source: Add Directory
zh_hans: 添加目录

# source.action.addRepository
source: Add Repository
zh_hans: 添加仓库

# source.action.delete
source: Delete
zh_hans: 删除

# source.action.updateAll
source: Update All
zh_hans: 一键更新

# source.banner.unavailable
source: Some sources are unavailable
zh_hans: 有来源暂不可用

# source.empty.git
source: No Git repositories
zh_hans: 暂无 Git 仓库

# source.empty.local
source: No local directories
zh_hans: 暂无本地目录

# source.error.directoryNotFound
source: Directory not found
zh_hans: 目录不存在

# source.header.title
source: Sources
zh_hans: 来源管理

# source.modal.branchOptional
source: Branch (Optional):
zh_hans: 分支 (可选):

# source.modal.repoUrl
source: Repository URL:
zh_hans: 仓库地址:

# source.modal.title
source: Add Git Repository
zh_hans: 添加 Git 仓库

# source.row.processing
source: Processing...
zh_hans: 处理中...

# source.section.git
source: Git Repositories
zh_hans: Git 仓库

# source.section.local
source: Local Directories
zh_hans: 本地目录

# toast.language.chinese
source: Language changed to Chinese (Simplified)
zh_hans: 语言已切换至 简体中文

# toast.language.english
source: Language changed to English
zh_hans: 语言已切换至 English

# topbar.search.placeholder
source: Search skills...
zh_hans: 搜索 skills...
